Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁྲི་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Transcendent Perfection of Wisdom in Ten Thousand Lines

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all the buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard on a certain occasion.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཕྲག་དུ་མའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing at Vulture Peak near Rāja­gṛha with a large monastic gathering comprising many thousands of fully ordained monks.

source: ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ། ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ། ཡོངས་སུ་ཟད་པ། ཡང་དག་པའི་ཤེས་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཤ་སྟག་སྟེ། གང་ཟག་གཅིག་མ་གཏོགས་པ་ནི་འདི་ལྟ་སྟེ། སློབ་པ་རྒྱུན་ཏུ་ཞུགས་པ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའོ། །
en: All of them were arhats who had attained the cessation of contaminants and were without afflicted mental states, fully controlled, their minds thoroughly liberated, their wisdom well liberated, thoroughbreds, mighty nāgas, their tasks accomplished, their work completed, their burdens relinquished, their own objectives already fulfilled, the fetters binding them to the rebirth process completely severed, their minds thoroughly liberated through their genuine understanding, having perfected the highest of all mental faculties, with the exception of one person—the venerable Ānanda, a disciple who had merely entered the stream.

source: དགེ་སློང་མ་ལྔ་བརྒྱ་ཙམ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་ཐམས་ཅད་ཀྱང་བདེན་པ་མཐོང་བ་ཤ་སྟག་དང་།
en: Also present were some five hundred fully ordained nuns, laymen, and laywomen, all of whom had seen the truth.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྟོང་ཕྲག་དུ་མ་ཐམས་ཅད་ཀྱང་གཟུངས་ཐོབ་པ། ཏིང་ངེ་འཛིན་ཐོབ་པ། སྟོང་པ་ཉིད་ལ་གནས་པ། མཚན་མ་མེད་པའི་སྤྱོད་ཡུལ་བ། མ་བརྟགས་པའི་སྨོན་ལམ་དང་ལྡན་པ། མཉམ་པ་ཉིད་ཀྱི་བཟོད་པ་ཐོབ་པ།
en: There, too, were many thousands of great bodhisattva beings, all of whom had mastered the dhāraṇīs and attained the meditative stabilities, and were abiding in emptiness, their perceptual range being one of signlessness, their aspirations free from discrimination, their attainments the acceptance of sameness and inspired eloquence that was unimpeded.

source: སྤོབས་པ་ཐོགས་པ་མེད་པ་ཐོབ་པ་ཐམས་ཅད་ཀྱང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ། གཟུང་བའི་ཚིག་དང་ལྡན་པ།
en: Indeed they all had the five extrasensory powers and captivating speech.

source: ཚུལ་འཆོས་པ་མེད་པ། ཤེས་ཀྱི་ཁེ་དང་། རྙེད་པ་དང་། བཀུར་སྟིའི་སེམས་དང་བྲལ་བ།
en: Their ethical conduct was without artificiality and they had no thoughts of ulterior profit, acquisition, or fame.

source: ཟང་ཟིང་མེད་པའི་ཆོས་སྟོན་པ།
en: They could teach the sacred doctrine, free from worldliness.

source: ཆོས་ཟབ་མོ་ལ་བཟོད་པའི་ཕ་རོལ་ཏུ་སོན་པ། མི་འཇིགས་པ་ཐོབ་པ། བདུད་ཀྱི་ལས་ལས་ཡང་དག་པར་འདས་པ།
en: They had perfected their acceptance of the profound nature of phenomena; they had acquired assurance and completely gone beyond demonic activities.

source: ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ལས་རྣམ་པར་གྲོལ་བ། བསྟན་པའི་ཆོས་སྟོན་པས་བསགས་པ། བསྐལ་པ་གྲངས་མེད་པ་ནས་སྨོན་ལམ་ཤིན་ཏུ་བསགས་པ།
en: Liberated from all obscurations associated with past actions, they had accumulated merits by teaching the sacred doctrine, extensively accumulating their aspirations over countless eons.

source: བཞིན་འཛུམ་པ་དང་ལྡན་པ། གསོང་པོར་སྨྲ་བ། བཞིན་ཁྲོ་གཉེར་མེད་པ།
en: Their speech was honest with a smiling demeanor, their countenances without frowns of anger.

source: འཁོར་མཐའ་ཡས་པ་ཟིལ་གྱིས་གནོན་པའི་མི་འཇིགས་པ་དང་ལྡན་པ།
en: They possessed the assurance that overwhelms endless assemblies.

source: བསྐལ་པ་བྱེ་བ་ཕྲག་དུ་མར་བསྟན་པས་ངེས་པར་འབྱུང་བ་ལ་མཁས་པ།
en: They were skilled in their emancipation from cyclic existence, as they had demonstrated for many tens of millions of eons.

source: ཆོས་ལ་སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། རྨི་ལམ་དང་། ཆུ་ཟླ་དང་། མིག་ཡོར་དང་། ནམ་མཁའ་དང་། བྲག་ཅ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་དང་། གཟུགས་བརྙན་དང་། སྤྲུལ་པ་ལྟ་བུར་མོས་པ། མི་འཇིགས་པ་ཚད་མེད་པ་དང་ལྡན་པ།
en: They regarded phenomena as a magical display, a mirage, a dream, the moon reflected in water, an optical aberration, empty space, an echo, a castle in the sky, or a phantom, and they were endowed with immeasurable assurance.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་། མོས་པ་དང་། ཕྲ་བ་མཁྱེན་པ། ཁོང་དུ་ཆུད་པར་བྱ་བ་ལ་མཁས་པ།
en: They were skilled in comprehending the mental attitudes and interests of all sentient beings, and the knowledge that engages in subtlety.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཞེ་འགྲས་པ་མེད་པའི་སེམས་དང་ལྡན་པ། བཟོད་པ་ཆེན་པོ་དང་ལྡན་པ།
en: Toward all sentient beings their attitude was without any animosity and imbued with great tolerance.

source: ཇི་ལྟ་བ་བཞིན་དུ་འཇུག་པ་ལ་མཁས་པ།
en: They were skilled in definitively introducing them to the nature of reality.

source: སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་སྨོན་ལམ་ཡོངས་སུ་བཟུང་བ།
en: They held them in their aspirations for infinite buddhafields.

source: འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པའི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་ཏིང་ངེ་འཛིན་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མངོན་དུ་གྱུར་པ།
en: At all times they uninterruptedly actualized the meditative stability that recollects the buddhas of countless world systems.

source: སངས་རྒྱས་དཔག་ཏུ་མེད་པ་ལ་གསོལ་བ་འདེབས་པ་ལ་མཁས་པ། ལྟ་བ་སྣ་ཚོགས་ཀྱིས་ཀུན་ནས་བསླང་བའི་ཉོན་མོངས་པ་སྤོང་བ་ལ་མཁས་པ།
en: They were well-versed in questioning the innumerable buddhas, and skillful in the abandoning of afflicted mental states motivated by diverse mistaken views.

source: ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་རྩེ་བ་འབུམ་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟང་སྐྱོང་དང་། དཀོན་མཆོག་འབྱུང་གནས་དང་། དེད་དཔོན་དང་། ན་ལས་བྱིན་དང་། གཟས་བྱིན་དང་། ཆུ་ལྷས་བྱིན་དང་། དབང་པོས་བྱིན་དང་། བློ་གྲོས་རྒྱ་ཆེན་དང་། བློ་གྲོས་ཁྱད་པར་ཅན་དང་། བློ་གྲོས་འཕེལ་དང་། མཐོང་བ་དོན་ཡོད་དང་། ཤིན་ཏུ་ཡང་དག་ཞུགས་དང་། རབ་ཀྱི་རྩལ་གྱིས་རྣམ་པར་གནོན་པ་དང་། རྟག་ཏུ་བརྩོན་དང་། བརྩོན་པ་མི་གཏོང་བ་དང་། ཉི་མའི་སྙིང་པོ་དང་། ཟླ་བའི་སྙིང་པོ་དང་། བློ་གྲོས་དཔེ་མེད་དང་། སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་།
en: They were all bodhisattvas who knew how to actualize one hundred thousand emanational displays by means of their meditative stability.

source: འཇམ་དཔལ་དང་། ལག་ན་ཕྱག་རྒྱ་རིན་པོ་ཆེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་ལག་བརྐྱང་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་། དེ་དག་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་དུ་མ་ཐམས་ཅད་ཀྱང་གཞོན་ནུར་གྱུར་པ་ཤ་སྟག་དང་།
en: Among them were the following: the great being Bhadra­pāla, along with Ratnā­kara, Sārtha­vāha, Nara­datta, Graha­datta, Varuṇa­datta, Indra­datta, Uttara­mati, Vi­śeṣa­mati, Vardhamāna­mati, A­mogha­darśin, Su­saṃ­prasthita, Su­vikrānta­vikrāmin, Nityodyukta, Anikṣiptadhura, Sūrya­garbha, Candra­garbha, An­upama­cintin, Avalokiteśvara, Mañjuśrī, Ratna­mudrā­hasta, the bodhisattva Nityotkṣipta­hasta and the great bodhisattva being Maitreya, heading many thousands of accompanying bodhisattvas, all of whom were youthful in appearance.

source: ཐབས་ཅིག་གོ། །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱི་གཟི་བརྗིད་ཟིལ་གྱིས་མནན་ནས།
en: At that time, the Blessed One outshone Śakra, Brahmā, and all the worldly protectors.

source: འཁོར་བཞི་པོ་དེ་དག་གི་མདུན་ན་ལམ་མེ་ལྷན་ནེ་ལྷང་ངེ་ཞིང་རྫུ་འཕྲུལ་གྱིས་རྣམ་པར་འཕྲུལ་བའི་ཆོ་འཕྲུལ་རྣམ་པ་དུ་མ་དག་ཡང་དག་པར་བསྟན་ཏོ། །
en: Then, in the presence of these four assemblies, he demonstrated multiple miraculous forms, vivid, brilliant and distinct, which were emanated through his magical abilities.

source: སྤུའི་ཁུང་བུ་རྣམས་ནས་ཀྱང་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་བྱུང་བར་གྱུར་ཏོ། །
en: Also, from all the pores of his body, an effulgence of light rays shone forth—many hundreds of billion trillions in number.

source: ཡང་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤ་ར་དཱ་ཏིའི་བུ་འཁོར་དེར་འདུས་པར་གྱུར་ཏེ། འདུག་པ་དེས་དེ་བཞིན་གཤེགས་པའི་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་བའི་ཆོ་འཕྲུལ་དེ་ལྟ་བུ་མཐོང་ནས་དགའ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ།
en: Thereupon, the venerable Śāradvatī­putra, who was present within the assembly, observed those miraculous forms emanated through the miraculous abilities of the Tathā­gata.

source: རབ་ཏུ་མགུ་ཞིང་དགའ་བ་དང་།
en: He was delighted.

source: ཡིད་བདེ་བ་སྐྱེས་ནས།
en: He rejoiced.

source: སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན།
en: His extreme joy gave rise to such delight and contentment that, rising from his seat, with his upper robe over one shoulder, he rested his right knee on the ground and placed his hands together in the gesture of homage, facing in the direction of Blessed One, while asking the Blessed One as follows: “If I might be permitted to request the Reverend Lord to pronounce on them, may I put certain questions to the Reverend Lord?”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུ་ལགས་སོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་ཞུ་བའི་ཕྱིར་རྟག་ཏུ་སྐབས་ཕྱེ་ཟིན་གྱིས་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། དྲིས་པ་དེ་དང་དེའི་ལན་བཏབ་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: The Blessed One then replied to the venerable Śāradvatī­putra, “Śāradvatī­putra, since you always have had opportunities to question the Tathā­gata, you may ask whatever you wish, and you should be satisfied with the answers to your questions.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བགྱི་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་གང་ལགས།
en: The venerable Śāradvatī­putra then asked the Blessed One, “Reverend Lord, with regard to that which is called the transcendent perfection of wisdom, Reverend Lord, what exactly is the transcendent perfection of wisdom of the bodhisattvas?

source: ཆོས་གང་གི་ཕ་རོལ་ཏུ་ཕྱིན་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕ་རོལ་ཏུ་སོན་པ་ལགས་ཤིང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་འགྱུར་ལགས།
en: By perfecting what sacred doctrine do bodhisattvas perfect the transcendent perfection of wisdom and swiftly attain manifestly perfect buddhahood in unsurpassed, genuinely perfect enlightenment?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ། །
en: Thereupon, the Blessed One inspired the venerable Śāradvatī­putra with the words, “Excellent, Śāradvatī­putra!

source: འདི་ལྟར་ཁྱོད་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་ཞུ་བ་ཞུས་པ་མཛེས་སོ། །
en: Excellent! Excellent! Through the blessings of the Tathā­gata you have made a splendid request.

source: ཁྱོད་ཀྱིས་ཡོངས་སུ་རྟོག་པ་བཟང་ངོ་། །
en: You have had an excellent idea!

source: དེའི་ཕྱིར་ཁྱོད་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པར་བྱའོ། །
en: To that end, you should listen carefully, keep my words in mind, and I shall teach the transcendent perfection of wisdom.”

source: བཙུན་པ་དེ་ལྟར་འཚལ་ལོ་ཞེས་གསོལ་ཏེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: “Reverend Lord, so be it!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: he replied.

source: ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ལ་མངོན་པར་ཞེན་པ་མེད་པ་ཡིན་ནོ། །
en: So it was that the venerable Śāradvatī­putra listened to the Blessed One, and the Lord replied, “Śāradvatī­putra, that which is called the transcendent perfection of wisdom is the absence of fixation with respect to all things.

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཞེན་པ་མེད་པ་རྣམས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཡིན་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་འགྱུར་རོ། །གསོལ་པ།
en: Śāradvatī­putra, bodhisattvas who are without fixation perfect the transcendent perfection of wisdom, and will indeed swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་གང་ལ་མངོན་པར་ཞེན་པར་མི་བགྱི་བའི་ཆོས་དེ་དག་ཐམས་ཅད་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། ཕུང་པོ་ལྔ་དང་། སྐྱེ་མཆེད་བཅུ་གཉིས་དང་། ཁམས་བཅྭ་བརྒྱད་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡན་ལག་བཅུ་གཉིས་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་།
en: Then he asked, “Reverend Lord, what are all those things on which great bodhisattva beings should not be fixated?”

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྨོན་པ་མེད་པ་ཉིད་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། འདུ་ཤེས་དགུ་དང་། རྗེས་སུ་དྲན་པ་བཅུ་དང་། འདུ་ཤེས་ཀྱི་རྣམ་པ་དྲུག་དང་། ཆོས་ཤེས་པ་དང་། རྗེས་སུ་རྟོགས་པ་ཤེས་པ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་། ཀུན་རྫོབ་ཤེས་པ་དང་། སྡུག་བསྔལ་ཤེས་པ་དང་། ཀུན་འབྱུང་ཤེས་པ་དང་། འགོག་པ་ཤེས་པ་དང་། ལམ་ཤེས་པ་དང་། ཟད་པ་ཤེས་པ་དང་། མི་སྐྱེ་བ་ཤེས་པ་དང་། ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་དང་། དེ་བཞིན་དུ་རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་དང་། རྟོག་པ་མེད་པ་ལ་དཔྱོད་པ་ཙམ་གྱི་ཏིང་ངེ་འཛིན་དང་། མི་རྟོག་མི་དཔྱོད་པའི་ཏིང་ངེ་འཛིན་དང་། མི་ཤེས་པ་ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པའི་དབང་པོ་དང་། ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་དང་། ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་དང་། ཟད་པར་གྱི་སྐྱེ་མཆེད་བཅུ་དང་། སྟོང་པ་ཉིད་བཅྭ་བརྒྱད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་དང་། དེ་བཞིན་དུ་ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། མིག་ལྔ་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་པོ་དག་སྟེ།
en: The Blessed One replied, “Śāradvatī­putra, the expression ‘all things’ denotes the following: the five psycho-physical aggregates, the twelve sense fields, the eighteen sensory elements, the four noble truths, the twelve links of dependent origination, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the emptiness that is a gateway to liberation, the signlessness that is a gateway to liberation, the aspirationlessness that is a gateway to liberation, the four meditative concentrations, the four immeasurable aspirations, the four formless meditative absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the nine contemplations of impurity, the ten recollections, the six aspects of perception, the knowledge of phenomena, the subsequent knowledge, the knowledge of other minds, the knowledge of relative appearances, the knowledge of suffering, the knowledge of the origin of suffering, the knowledge of the cessation of suffering, the knowledge of the path, the knowledge of the extinction of contaminants, the knowledge that contaminants will not be regenerated, the knowledge that is definitive, and similarly, the meditative stability endowed with ideation and scrutiny, the meditative stability free from ideation and merely endowed with scrutiny, the meditative stability free from both ideation and scrutiny, the faculties that will enable knowledge of all that is unknown, the faculties that acquire the knowledge of all things, the faculties endowed with the knowledge of all things, the eight sense fields of mastery, the ten sense fields of total consummation, the eighteen aspects of emptiness, the ten powers of the tathāgatas, the four assurances, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, and likewise, the understanding of all phenomena, the understanding of the aspects of the path, the understanding of omniscience, the six transcendent perfections, the five extrasensory powers, the five eyes, the thirty-two major marks of a superior man, and the eighty excellent minor marks.

source: གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་མངོན་པར་ཞེན་པར་མི་བྱ་བའི་ཆོས་ཐམས་ཅད་ནི་དེ་དག་ཡིན་ནོ། །
en: All these are the things on which great bodhisattva beings should not be fixated.

source: མངོན་པར་ཞེན་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕ་རོལ་ཏུ་སོན་པ་ཡིན་ཞིང་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་འགྱུར་རོ། །
en: One who is without fixation perfects the transcendent perfection of wisdom and will also swiftly attain manifestly perfect buddhahood in unsurpassed and genuinely perfect enlightenment.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཕུང་པོ་ལྔ་གང་ལགས་ཞེས་བྱ་བ་ནས་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་པའི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: Then the venerable Śāradvatī­putra asked the Blessed One, “Reverend Lord, what are the ‘five psycho-physical aggregates’ and likewise [those other phenomena], up to and including the ‘twelve links of dependent origination’?

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་གང་ལགས་ཞེས་བྱ་བ་ནས་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: What are the ‘four applications of mindfulness’, and likewise [those other causal attributes] up to and including the ‘noble eightfold path’?

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་གང་ལགས་ཞེས་བྱ་བ་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་རོ། །
en: What is the ‘emptiness that is a gateway to liberation,’ and likewise [those other attainments], up to and including ‘omniscience’?

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ལགས་ཞེས་བྱ་བ་ནས་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་པོ་དག་ཅེས་བྱ་བའི་བར་དུ་དེ་བཞིན་དུ་སྦྱར་རོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: What are the ‘six transcendent perfections,’ and likewise [those other fruitional attributes], up to and including the ‘eighty minor marks’?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤ་ར་དྭ་ཏིའི་བུ་ཕུང་པོ་ལྔ་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་།
en: Thereupon, the Blessed One addressed the venerable Śāradvatī­putra as follows: “Śāradvatī­putra, the ‘five psycho-physical aggregates’ comprise (1) physical forms, (2) feelings, (3) perceptions, (4) formative predispositions, and (5) consciousness.

source: འདུ་བྱེད་རྣམས་དང་། རྣམ་པར་ཤེས་པའོ། །དེ་ལ་སྐྱེ་མཆེད་བཅུ་གཉིས་གང་ཞེ་ན། ནང་གི་དྲུག་དང་། ཕྱིའི་དྲུག་སྟེ།
en: “If you ask what are the ‘twelve sense fields,’ they comprise six that are inner and six that are outer.

source: དེ་དག་ནི་སྐྱེ་མཆེད་བཅུ་གཉིས་ཞེས་བྱའོ། །
en: These are called the twelve sense fields.

source: དེ་ལ་ནང་གི་སྐྱེ་མཆེད་དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། །མིག་གི་སྐྱེ་མཆེད་དང་། རྣ་བའི་སྐྱེ་མཆེད་དང་། སྣའི་སྐྱེ་མཆེད་དང་།
en: Among them, if you ask what are the ‘six inner sense fields,’ they comprise (1) the sense field of the eyes, (2) the sense field of the ears, (3) the sense field of the nose, (4) the sense field of the tongue, (5) the sense field of the body, and (6) the sense field of the mental faculty.

source: ལྕེའི་སྐྱེ་མཆེད་དང་། ལུས་ཀྱི་སྐྱེ་མཆེད་དང་། ཡིད་ཀྱི་སྐྱེ་མཆེད་དེ། དེ་དག་ནི་ནང་གི་སྐྱེ་མཆེད་དྲུག་ཅེས་བྱའོ། །
en: These are called the six inner sense fields.

source: དེ་ལ་ཕྱིའི་སྐྱེ་མཆེད་དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གཟུགས་ཀྱི་སྐྱེ་མཆེད་དང་། སྒྲའི་སྐྱེ་མཆེད་དང་། དྲིའི་སྐྱེ་མཆེད་དང་།
en: “Then, if you ask what are the ‘six outer sense fields,’ they comprise (7) the sense field of sights, (8) the sense field of sounds, (9) the sense field of odors, (10) the sense field of tastes, (11) the sense field of tangibles, and (12) the sense field of mental phenomena.

source: རོའི་སྐྱེ་མཆེད་དང་། རེག་བྱའི་སྐྱེ་མཆེད་དང་། ཆོས་ཀྱི་སྐྱེ་མཆེད་དེ། དེ་དག་ནི་ཕྱིའི་སྐྱེ་མཆེད་དྲུག་ཅེས་བྱའོ། །དེ་ལ་ཁམས་བཅྭ་བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མིག་གི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་།
en: These are called the six outer sense fields.

source: མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། རྣ་བའི་ཁམས་དང་། སྒྲའི་ཁམས་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། སྣའི་ཁམས་དང་། དྲིའི་ཁམས་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལྕེའི་ཁམས་དང་། རོའི་ཁམས་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ལུས་ཀྱི་ཁམས་དང་། རེག་བྱའི་ཁམས་དང་།
en: “If you ask what are the ‘eighteen sensory elements,’ they comprise (1) the sensory element of the eyes, (2) the sensory element of sights, and (3) the sensory element of visual consciousness; (4) the sensory element of the ears, (5) the sensory element of sounds, and (6) the sensory element of auditory consciousness; (7) the sensory element of the nose, (8) the sensory element of odors, and (9) the sensory element of olfactory consciousness; (10) the sensory element of the tongue, (11) the sensory element of tastes, and (12) the sensory element of gustatory consciousness; (13) the sensory element of the body, (14) the sensory element of tangibles, and (15) the sensory element of tactile consciousness; and (16) the sensory element of the mental faculty, (17) the sensory element of mental phenomena, and (18) the sensory element of mental consciousness.

source: ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་དང་། ཡིད་ཀྱི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཏེ། དེ་དག་ནི་ཁམས་བཅྭ་བརྒྱད་ཅེས་བྱའོ། །
en: These are called the eighteen sensory elements.

source: དེ་ལ་འཕགས་པའི་བདེན་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྡུག་བསྔལ་འཕགས་པའི་བདེན་པ་དང་། ཀུན་འབྱུང་བ་འཕགས་པའི་བདེན་པ་དང་། འགོག་པ་འཕགས་པའི་བདེན་པ་དང་།
en: “If you ask what are the ‘four noble truths,’ they comprise (1) the noble truth of suffering, (2) the noble truth of the origin of suffering, (3) the noble truth of the cessation of suffering, and (4) the noble truth of the path.

source: ལམ་འཕགས་པའི་བདེན་པ་སྟེ། དེ་དག་ནི་འཕགས་པའི་བདེན་པ་བཞི་ཞེས་བྱའོ། །དེ་ལ་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མ་རིག་པའི་རྐྱེན་གྱིས་འདུ་བྱེད་རྣམས། འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ།
en: These are called the four noble truths.

source: རྣམ་པར་ཤེས་པའི་རྐྱེན་གྱིས་མིང་དང་གཟུགས། མིང་དང་གཟུགས་ཀྱི་རྐྱེན་གྱིས་སྐྱེ་མཆེད་དྲུག ། སྐྱེ་མཆེད་དྲུག་གི་རྐྱེན་གྱིས་རེག་པ། རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ། ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ། སྲེད་པའི་རྐྱེན་གྱིས་ལེན་པ། ལེན་པའི་རྐྱེན་གྱིས་སྲིད་པ། སྲིད་པའི་རྐྱེན་གྱིས་སྐྱེ་བ། སྐྱེ་བའི་རྐྱེན་གྱིས་རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་།
en: “If you ask what are the ‘twelve links of dependent origination,’ they comprise (1) fundamental ignorance, contingent on which (2) formative predispositions arise; (3) consciousness, which arises contingent on formative predispositions; (4) name and form, which arise contingent on consciousness; (5) the six sense fields, which arise contingent on name and form; (6) sensory contact, which arises contingent on the six sense fields; (7) sensation, which arises contingent on sensory contact; (8) craving, which arises contingent on sensation; (9) grasping, which arises contingent on craving; (10) the rebirth process, which arises contingent on grasping; (11) actual birth, which arises contingent on the rebirth process; and (12) aging and death, along with sorrow, lamentation, suffering, mental discomfort, and agitation, which all arise contingent on actual birth.

source: སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུགས་པ་རྣམས་འབྱུང་སྟེ། དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་ཆེན་པོ་འབའ་ཞིག་པོ་འདི་དག་འབྱུང་བར་འགྱུར་རོ། །
en: It is in this way that these great corporeal aggregates, exclusively endowed with suffering, arise.

source: མ་རིག་པ་འགགས་པས་འདུ་བྱེད་འགག །
en: “Conversely, through the cessation of fundamental ignorance, formative predispositions cease.
